tutorials/coriolisABLFoam/windVeeringABLkEpsilon/windVeering_FengAndGu2020_zeroGradient_fe32/constant/polyMesh/blockMeshDict_cyclic
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0 3)
    (0 0 3)
    (0 -1 0)
    (1 -1 0)
    (1 -1 3)
    (0 -1 3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 50 10) simpleGrading (1 8 1)
);

edges
(
);

boundary
(
    inletOutlet
    {
        type cyclic;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
    sides
    {
        type cyclic;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomRoughWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
